; domain
(define (domain depot)
(:predicates
	 (at ?x ?y) (on ?x ?y) (in ?x ?y) (lifting ?x ?y) (available ?x) (clear ?x)(place ?x) (locatable ?x) (depot ?x) (distributor ?x) (truck ?x) (hoist ?x) (surface ?x) (pallet ?x) (crate ?x) )
(:action drive
 :parameters ( ?x ?y ?z)
 :precondition
	(and (truck ?x) (place ?y) (place ?z)  (at ?x ?y))
 :effect
	(and (at ?x ?z) (not (at ?x ?y))))

(:action lift
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (surface ?z) (place ?p)  (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
 :effect
	(and (lifting ?x ?y) (clear ?z) (not (at ?y ?p)) (not (clear ?y)) (not (available ?x)) (not (on ?y ?z))))

(:action drop
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (surface ?z) (place ?p)  (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
 :effect
	(and (available ?x) (at ?y ?p) (clear ?y) (on ?y ?z) (not (lifting ?x ?y)) (not (clear ?z))))

(:action load
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (truck ?z) (place ?p)  (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
 :effect
	(and (in ?y ?z) (available ?x) (not (lifting ?x ?y))))

(:action unload
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (truck ?z) (place ?p)  (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
 :effect
	(and (lifting ?x ?y) (not (in ?y ?z)) (not (available ?x))))

)

; problem
(define (problem depotprob1212) (:domain Depot)
(:objects
	depot0 distributor0 distributor1 truck0 truck1 pallet0 pallet1 pallet2 crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 hoist0 hoist1 hoist2 )
(:init
	(pallet pallet0)
	(surface pallet0)
	(at pallet0 depot0)
	(clear crate4)
	(pallet pallet1)
	(surface pallet1)
	(at pallet1 distributor0)
	(clear crate8)
	(pallet pallet2)
	(surface pallet2)
	(at pallet2 distributor1)
	(clear crate9)
	(truck truck0)
	(at truck0 depot0)
	(truck truck1)
	(at truck1 distributor0)
	(hoist hoist0)
	(at hoist0 depot0)
	(available hoist0)
	(hoist hoist1)
	(at hoist1 distributor0)
	(available hoist1)
	(hoist hoist2)
	(at hoist2 distributor1)
	(available hoist2)
	(crate crate0)
	(surface crate0)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(crate crate1)
	(surface crate1)
	(at crate1 depot0)
	(on crate1 pallet0)
	(crate crate2)
	(surface crate2)
	(at crate2 distributor1)
	(on crate2 crate0)
	(crate crate3)
	(surface crate3)
	(at crate3 depot0)
	(on crate3 crate1)
	(crate crate4)
	(surface crate4)
	(at crate4 depot0)
	(on crate4 crate3)
	(crate crate5)
	(surface crate5)
	(at crate5 distributor1)
	(on crate5 crate2)
	(crate crate6)
	(surface crate6)
	(at crate6 distributor0)
	(on crate6 pallet1)
	(crate crate7)
	(surface crate7)
	(at crate7 distributor0)
	(on crate7 crate6)
	(crate crate8)
	(surface crate8)
	(at crate8 distributor0)
	(on crate8 crate7)
	(crate crate9)
	(surface crate9)
	(at crate9 distributor1)
	(on crate9 crate5)
	(place depot0)
	(place distributor0)
	(place distributor1)
)

(:goal (and
		(on crate0 crate5)
		(on crate1 pallet1)
		(on crate2 crate0)
		(on crate3 pallet2)
		(on crate4 crate6)
		(on crate5 crate4)
		(on crate6 crate9)
		(on crate7 crate1)
		(on crate8 crate3)
		(on crate9 pallet0)
	)
))

; plan
1. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   goals met: 1 of 10
2. (lift hoist2 crate9 crate5 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist2) (on crate9 crate5)
   added: (lifting hoist2 crate9) (clear crate5)
   goals met: 1 of 10
3. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   goals met: 1 of 10
4. (lift hoist0 crate3 crate1 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate1)
   added: (lifting hoist0 crate3) (clear crate1)
   goals met: 1 of 10
5. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   goals met: 1 of 10
6. (lift hoist1 crate8 crate7 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist1) (on crate8 crate7)
   added: (lifting hoist1 crate8) (clear crate7)
   goals met: 1 of 10
7. (load hoist1 crate8 truck1 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck1) (available hoist1)
   goals met: 1 of 10
8. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate6)
   added: (lifting hoist1 crate7) (clear crate6)
   goals met: 1 of 10
9. (load hoist1 crate7 truck1 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   goals met: 1 of 10
10. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 1 of 10
11. (load hoist2 crate9 truck0 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   goals met: 1 of 10
12. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   goals met: 1 of 10
13. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 1 of 10
14. (unload hoist0 crate9 truck0 depot0)
   deleted: (in crate9 truck0) (available hoist0)
   added: (lifting hoist0 crate9)
   goals met: 1 of 10
15. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 1 of 10
16. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 1 of 10
17. (drop hoist1 crate4 crate6 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate6)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate6)
   goals met: 2 of 10
18. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 10
19. (load hoist0 crate9 truck1 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck1) (available hoist0)
   goals met: 2 of 10
20. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 2 of 10
21. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 2 of 10
22. (unload hoist0 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist0)
   added: (lifting hoist0 crate9)
   goals met: 2 of 10
23. (drop hoist0 crate9 pallet0 depot0)
   deleted: (lifting hoist0 crate9) (clear pallet0)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 pallet0)
   goals met: 3 of 10
24. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 3 of 10
25. (unload hoist1 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 3 of 10
26. (drop hoist1 crate1 crate4 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate4)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 crate4)
   goals met: 3 of 10
27. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   goals met: 3 of 10
28. (drop hoist1 crate7 crate1 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate1)
   goals met: 4 of 10
29. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 4 of 10
30. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   goals met: 4 of 10
31. (lift hoist2 crate5 crate2 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate2)
   added: (lifting hoist2 crate5) (clear crate2)
   goals met: 4 of 10
32. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   goals met: 4 of 10
33. (lift hoist2 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate0)
   added: (lifting hoist2 crate2) (clear crate0)
   goals met: 3 of 10
34. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   goals met: 3 of 10
35. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   goals met: 3 of 10
36. (load hoist2 crate0 truck1 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   goals met: 3 of 10
37. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   goals met: 3 of 10
38. (drop hoist2 crate3 pallet2 distributor1)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 pallet2)
   goals met: 4 of 10
39. (unload hoist2 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist2)
   added: (lifting hoist2 crate8)
   goals met: 4 of 10
40. (drop hoist2 crate8 crate3 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate3)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate3)
   goals met: 5 of 10
41. (unload hoist2 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist2)
   added: (lifting hoist2 crate5)
   goals met: 5 of 10
42. (drop hoist2 crate5 crate8 distributor1)
   deleted: (lifting hoist2 crate5) (clear crate8)
   added: (available hoist2) (at crate5 distributor1) (clear crate5) (on crate5 crate8)
   goals met: 5 of 10
43. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   goals met: 5 of 10
44. (drop hoist2 crate0 crate5 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate5)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate5)
   goals met: 6 of 10
45. (unload hoist2 crate2 truck1 distributor1)
   deleted: (in crate2 truck1) (available hoist2)
   added: (lifting hoist2 crate2)
   goals met: 6 of 10
46. (drop hoist2 crate2 crate0 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate0)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 crate0)
   goals met: 7 of 10
47. (lift hoist1 crate7 crate1 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate1)
   added: (lifting hoist1 crate7) (clear crate1)
   goals met: 6 of 10
48. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   goals met: 6 of 10
49. (lift hoist1 crate1 crate4 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate4)
   added: (lifting hoist1 crate1) (clear crate4)
   goals met: 6 of 10
50. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 6 of 10
51. (lift hoist1 crate4 crate6 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate6)
   added: (lifting hoist1 crate4) (clear crate6)
   goals met: 5 of 10
52. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 5 of 10
53. (lift hoist1 crate6 pallet1 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 pallet1)
   added: (lifting hoist1 crate6) (clear pallet1)
   goals met: 5 of 10
54. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   goals met: 5 of 10
55. (unload hoist1 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 5 of 10
56. (drop hoist1 crate1 pallet1 distributor0)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 pallet1)
   goals met: 6 of 10
57. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   goals met: 6 of 10
58. (drop hoist1 crate7 crate1 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate1)
   goals met: 7 of 10
59. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 7 of 10
60. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 7 of 10
61. (drop hoist0 crate6 crate9 depot0)
   deleted: (lifting hoist0 crate6) (clear crate9)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate9)
   goals met: 8 of 10
62. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 8 of 10
63. (drop hoist0 crate4 crate6 depot0)
   deleted: (lifting hoist0 crate4) (clear crate6)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate6)
   goals met: 9 of 10
64. (lift hoist2 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate0)
   added: (lifting hoist2 crate2) (clear crate0)
   goals met: 8 of 10
65. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   goals met: 8 of 10
66. (lift hoist2 crate0 crate5 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 crate5)
   added: (lifting hoist2 crate0) (clear crate5)
   goals met: 7 of 10
67. (load hoist2 crate0 truck1 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   goals met: 7 of 10
68. (lift hoist2 crate5 crate8 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate8)
   added: (lifting hoist2 crate5) (clear crate8)
   goals met: 7 of 10
69. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   goals met: 7 of 10
70. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   goals met: 7 of 10
71. (drop hoist2 crate0 crate8 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate8)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate8)
   goals met: 7 of 10
72. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 7 of 10
73. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   goals met: 7 of 10
74. (drop hoist0 crate5 crate4 depot0)
   deleted: (lifting hoist0 crate5) (clear crate4)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate4)
   goals met: 8 of 10
75. (lift hoist2 crate0 crate8 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 crate8)
   added: (lifting hoist2 crate0) (clear crate8)
   goals met: 8 of 10
76. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 8 of 10
77. (load hoist2 crate0 truck1 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   goals met: 8 of 10
78. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 8 of 10
79. (unload hoist0 crate0 truck1 depot0)
   deleted: (in crate0 truck1) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 8 of 10
80. (drop hoist0 crate0 crate5 depot0)
   deleted: (lifting hoist0 crate0) (clear crate5)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate5)
   goals met: 9 of 10
81. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   goals met: 9 of 10
82. (drop hoist0 crate2 crate0 depot0)
   deleted: (lifting hoist0 crate2) (clear crate0)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate0)
   goals met: 10 of 10
